{'<a href="?page=help">Справка</a> / Общие сведения'|adminTitle}
Содержание:
<ul class="help_contents">
    <li>
        <a href="#editor">Текстовый редактор</a>
        <ul>
            <li><a href="#editor-info">Общий вид</a></li>
            <li><a href="#editor-links">Вставка ссылок в текст</a></li>
            <li><a href="#editor-images">Вставка изображений в текст</a></li>
        </ul>
    </li>
</ul>

<h1 id="editor">Текстовый редактор</h1>
<div class="help_div">
    <h2 id="editor-info">Общий вид</h2>
    <p>Наша студия была создана в Харькове (Украина) в 2010 году. Наша команда занимается <strong>созданием и разработкой сайтов</strong>.</p>
    
    <h2 id="editor-links">Вставка ссылок в текст</h2>
    <p>Наша студия была создана в Харькове (Украина) в 2010 году. Наша команда занимается <strong>созданием и разработкой сайтов</strong>.</p>
    
    <h2 id="editor-images">Вставка изображений в текст</h2>
    <p>Наша студия была создана в Харькове (Украина) в 2010 году. Наша команда занимается <strong>созданием и разработкой сайтов</strong>.</p>
</div>