{'<a href="?page=help">Справка</a> / Редактор страниц'|adminTitle}
<p><em>Редактор страниц - раздел, в котором осуществляется добавление и редактирование страниц сайта.</em></p>
Содержание:
<ul class="help_contents">
    <li>
        <a href="#actions">Действия</a>
        <ul>
            <li><a href="#actions-add">Добавление страниц</a></li>
            <li><a href="#actions-add-sub">Добавление подстраниц</a></li>
            <li><a href="#actions-edit">Редактирование страниц</a></li>
            <li><a href="#actions-del">Удаление страниц</a></li>
        </ul>
    </li>
    <li>
        <a href="#fields">Поля</a>
        <ul>
            <li><a href="#fields-name">Название</a></li>
            <li><a href="#fields-text">Текст</a></li>
            <li><a href="#fields-addr">Адрес</a></li>
            <li><a href="#fields-title">Title</a></li>
            <li><a href="#fields-description">Description</a></li>
            <li><a href="#fields-keywords">Keywords</a></li>
        </ul>
    </li>
</ul>

<h1 id="actions">Действия</h1>
<p>В разделе "<a href="?page=pages" class="help_link">Редактор страниц</a>" доступны следующие действия: добавление, добавление в подраздел, редактирование и удаление.</p>
<div class="help_div">
    <h2 id="actions-add">Добавление страниц</h2>
    <p>Для добавления страниц необходимо нажать на кнопку <span class="buttonh"><img src="img/icons/plus.png" alt="" /> Добавить страницу</span>. После чего Вы перейдёте на страницу с формой добавления страницы.</p>
    
    <h2 id="actions-add-sub">Добавление подстраниц</h2>
    <p>Структура редактора страниц построена подобно структуре папок на Вашем компьютере. В уже созданную страницу Вы можете добавлять подстраницы. Если Вы планируете на сайте делать большое количество текстовых страниц, то это сможет значительно ускорить процесс.</p>
    <p>Чтобы добавить подстраницу в уже созданную страницу Вам необходимо нажать на иконку <img src="img/icons/help/sub.png" alt="" />. После чего Вы перейдёте на страницу с формой добавления страницы.</p>
    
    <h2 id="actions-edit">Редактирование страниц</h2>
    <p>Чтобы изменить страницу или подстраницу Вам необходимо нажать на иконку <img src="img/icons/help/edit.png" alt="" />. После чего Вы перейдёте на страницу с формой редактирования страницы.</p>
    
    <h2 id="actions-del">Удаление страниц</h2>
    <p>Чтобы удалть страницу или подстраницу Вам необходимо нажать на иконку <img src="img/icons/help/del.png" alt="" />.</p>
    <p>При удалении страницы так же удаляются все подстраницы.</p>
</div>
<div class="divider"></div>

<h1 id="fields">Поля</h1>
<p>При работе с формой добавления и редактирования страницы Вам доступны следующие поля:</p>
<div class="help_div">
    <h2 id="fields-name">Название</h2>
    <p>Название страницы - текстовое поле не больше 128 символов.</p>
    
    <h2 id="fields-text">Текст</h2>
    <p>Поле с основной информацией на странице. Для удобства используется <a href="?page=help&cat=common#editor">текстовый редактор</a>.</p>
    
    <h2 id="fields-addr">Адрес</h2>
    <p>Текстовое поле не больше 128 символов. Этот адрес будет отображаться после названия сайта. Например, up-studio.net/<em>contacts</em>. Если адрес не занят, то Вы увидите сообщение <span class="green">"Адрес свободен"</span>, а если адрес занят - <span class="red">"Адрес уже занят"</span>.</p>
    
    <h2 id="fields-title">Title</h2>
    <p>Один из наиболее важных тегов, которому поисковые системы придают огромное значение. Обязательно нужно использовать здесь ключевые слова. Кроме того, ссылка на ваш сайт в выдаче поисковой системы будет содержать текст из тега <em>Title</em>, так что это, в некотором роде, визитная карточка страницы. Именно по этой ссылке осуществляется переход посетителя поисковой системы на ваш сайт, поэтому тег <em>Title</em> должен не только содержать ключевые слова, но быть информативным и привлекательным. Как правило, в выдачу поисковой системы попадает 50-80 символов, поэтому размер заголовка желательно ограничить этой длинной.</p>
    <p style="text-align: center;"><img src="img/help/title.jpg" alt="" style="border: 1px solid #dbdbdb; border-radius: 2px;" /><br />
    Рис. 1 - Метатег Title в браузере
    </p>
    <p style="text-align: center;"><img src="img/help/title2.jpg" alt="" style="border: 1px solid #dbdbdb; border-radius: 2px;" /><br />
    Рис. 2 - Метатег Title в органической выдачи Google
    </p>
    
    <h2 id="fields-description">Description</h2>
    <p>Мета-тег <em>Description</em> специально предназначен для задания описания страницы. Этот тег никак не влияет на ранжирование, но, тем не менее, очень важен. Многие поисковые системы (и, в частности, крупнейшая Google) отображают информацию из этого тега в результатах поиска, если этот тег присутствует на странице и его содержимое соответствует содержимому страницы и поисковому запросу. Можно с уверенностью сказать, что высокое место в результатах поиска не всегда обеспечивает большое число посетителей. Если описание ваших конкурентов в результатах выдачи будет более привлекательным, чем вашего сайта, то посетители поисковой системы выберут именно их, а не Ваш ресурс. Поэтому грамотное составление метатега <em>Description</em> имеет большое значение. Описание должно быть кратким, но информативным и привлекательным, содержать ключевые слова, характерные для данной страницы.</p>
    
    <h2 id="fields-keywords">Keywords</h2>
    <p>Список ключевых слов, через запятую, которые употреблены при написании страницы. В этот тег необходимо прописывать ключевые слова и словосочетания, которые непосредственно присутствуют на данной конкретной странице, причем в начале нужно прописывать наиболее значимые слова. Ключевые слова, которых нет в тексте поисковая машина учитывать не будет, а значимость других ключевых слов в этом теге уменьшится.</p>
</div>